[
    {
        "_id":"1",
        "img":"https://res.cloudinary.com/ditdynru4/image/upload/v1673260026/oentvamhm98ks2lskcko.png",
        "title":"PayPal enables transfer of digital currencies to external wallets",
        "details":"The move comes after nearly two years since PayPal enabled users to buy and sell crypto on its platform.After rolling out the ability to buy and sell crypto on its platform in October 2020, PayPal is finally allowing users the ability to natively transfer, send and receive digital assets between PayPal and other wallets and exchanges. As of Tuesday, the feature is available to select U.S. users, with the feature expanding to all eligible U.S. users in the coming weeks. The first batch of supported coins consists of Bitcoin BTC $16,704, Ether  ETH $1,217, Bitcoin Cash BCH $100, and Litecoin LTC $74.58.  In addition, customers who transfer their crypto onto PayPal can spend it via Checkout at millions of merchant terminals. The company has been granted a full Bitlicense by the New York Department of Financial Services for the conduct.Users would simply need to log in to their accounts and enter the crypto section of the application to start transferring coins. Users are generally required to complete a one-time ID verification before the procedure.Crypto transfers to recipients outside of PayPal would incur a network fee based on their respective blockchains, but transfers between PayPal users will not incur such fees. To protect users' privacy, the firm generates a new recipient address for each transaction into one's PayPal account. PayPal will also not charge fees for incoming transfers,The company is also working to integrate other forms of cryptocurrency services, such as central bank digital currencies, to boost its digital footprint. It is also exploring the possibility of launching its own stablecoin, dubbed 'PayPal Coin'. The discovery came after a developer found evidence of such a stablecoin within the source code of the company's iPhone app."
    },
    {
        "_id":"2",
        "img":"https://res.cloudinary.com/ditdynru4/image/upload/v1673274513/avmdgod7ffzveje0pwvo.png",
        "title":" Microstrategy Buys More Bitcoin — Company's Crypto Holdings Grow to 132,500 BTC",
        "details":"Microstrategy is now holding approximately 132,500 bitcoin following its most recent purchases. This year, the world’s largest cryptocurrency has emerged as “the institutional-grade digital asset,” said Microstrategy founder Michael Saylor. Microstrategy Acquires More Bictoin Nasdaq-listed Microstrategy Inc. announced Wednesday that it has purchased more bitcoin for its corporate treasury. Michael Saylor, the company’s founder and executive chairman, tweeted Wednesday:Microstrategy has increased its bitcoin holdings by ~2,500 BTC. As of 12/27/22 Microstrategy holds ~132,500 bitcoin acquired for ~$4.03 billion at an average price of ~$30,397 per bitcoin.In its filing with the U.S. Securities and Exchange Commission Microstrategy clarified that the 2,500 coins were acquired between Nov. 1 and Dec. 24 by its wholly owned subsidiary Macrostrategy.The bitcoin sale in December marked the first time Microstrategy sold its bitcoin since it began accumulating the crypto for its corporate treasury in 2020. The company cited tax reasons for selling BTC. “Microstrategy plans to carry back the capital losses resulting from this transaction against previous capital gains, to the extent such carrybacks are available The subsidiary bought approximately 2,395 BTC at an average price of $17,871 per coin between Nov. 1 and Dec. 21. It then sold about 704 BTC at $16,776 per coin on Dec. 22. Macrostrategy then bought about 810 more BTC at $16,845 per coin on Dec. 24 . At the time of writing, bitcoin is trading at $16,656.80.under the federal income tax laws currently in effect, which may generate a tax benefit,” the SEC filing describes. Saylor said in an interview last week:The most positive thing of the year is the emergence of bitcoin as the institutional grade digital asset and the clarity that … there is one crypto asset that’s a digital commodity … Bitcoin is that commodity.The executive noted that both the chairman of the SEC and the chair of the Commodity Futures Trading Commission (CFTC) have confirmed that bitcoin is a commodity. Saylor previously explained that Microstrategy is investing in BTC “for the long term.” He added: “Our strategy is to buy bitcoin and hold the bitcoin, so there’s no price target … I expect bitcoin is going to go into the millions. So, we’re very patient. We think it’s the future of money"
    },
    {
        "_id":"3",
        "img":"https://res.cloudinary.com/ditdynru4/image/upload/v1673275886/fwt7jubpbqjrq4vljphw.png",
        "title":"Bitcoin Miners’ Revenue Hits $9.55 Billion in 2022",
        "details":"2022 has been a rough and tough year for investors,traders, cryptocurrency businesses, and miners in general. The prolonged bear market, exacerbated by a series of catastrophic events, posed a threat to miners.Miners were dealing with a variety of issues, including defaulted loans, quarterly losses, and soaring bitcoin hash rates that reached all-time highs. All these factors were affecting the profitability of the miners and were causing sell pressure.The situation was aggravated when cryptocurrency prices, including Bitcoin’s, plummeted. Bitcoin, which was hovering around $48,000 last year, hit a low of $15,590 by the end of 2022. According to the data collected from The Block, bitcoin miners’ revenue hit $9.55 billion in 2022.Bitcoin miners’ revenue dropped in 2022Bitcoin, which is trading at $16,721 at press time, has been on a downward spiral alongside other cryptocurrencies. The falling cryptocurrency prices had a major effect on the income and profits of miners. Even though the $9.55 billion in revenue in 2022 seems like a large number, it is comparatively lower than that of 2021.Over the course of 2021, bitcoin miners made more thqan $15 billion in revenue, according to the data from the block. This was actually considered to be a 206% year-over-year increase."
    },
    {
        "_id":"4",
        "img":"https://res.cloudinary.com/ditdynru4/image/upload/v1673276150/d3clyupsfpe4zrtguua0.png",
        "title":"Mango Markets Exploiter Eisenberg Arrested in Puerto Rico",
        "details":"The investor drained $110 million in cryptocurrencies from the platform.Avraham Eisenberg, the crypto investor whose “highly profitable trading strategy” drained DeFi trading platform Mango Markets of crypto worth $110 million, was  arrested Monday in Puerto Rico, court documents said.The self-described game theorist admitted his role in draining Mango Markets’ treasury shortly after the incident in mid-October, and may now be the first U.S. resident to face charges for his role in manipulating a decentralized-finance trading platform. Eisenberg faces charges of commodities fraud and commodities manipulation, according to a filing unsealed Tuesday. The charges could see punishments ranging from fines to prison time. A deposition signed by FBI Special Agent Brandon Racz alleges Eisenberg “willfully and knowingly” manipulated the sale of commodity – namely futures contracts on Mango Markets.“Eisenberg engaged in a scheme involving the intentional and artificial manipulation of the price of perpetual futures contracts on a cryptocurrency exchange called Mango Markets, and other manipulative and deceptive devices and contrivances."
    }
    
]